jonacappelle/nRF52-BLE-IMU/IMU/imu.c
				uint32_t buffer_len = sizeof(config_data) + sizeof(event->data.quaternion.quat);
				uint8_t buffer[buffer_len];

				// Copy data into buffer
				memcpy(buffer, config_data, sizeof(config_data));
				memcpy(&buffer[1], (event->data.quaternion.quat), sizeof(event->data.quaternion.quat));

				
				// Put the data in FIFO buffer: APP_FIFO instead of ringbuff library
            	err_code = app_fifo_write(&buff.imu_fifo, buffer, &buffer_len);
				if (err_code == NRF_ERROR_NO_MEM)
            	{
                	NRF_LOG_INFO("IMU FIFO BUFFER FULL!");
            	}
				if (err_code == NRF_SUCCESS)
				{
					NRF_LOG_INFO("OK");
				}
				#endif

				float quat[4];
				memcpy(quat, (event->data.quaternion.quat), sizeof(event->data.quaternion.quat));

				fixed_point_t p_quat[4];
				p_quat[0] = float_to_fixed_quat(quat[0]);
				p_quat[1] = float_to_fixed_quat(quat[1]);
				p_quat[2] = float_to_fixed_quat(quat[2]);
				p_quat[3] = float_to_fixed_quat(quat[3]);

				imu_data.quat.w = p_quat[0];
				imu_data.quat.x = p_quat[1];
				imu_data.quat.y = p_quat[2];
				imu_data.quat.z = p_quat[3];

				break;
			}
		case INV_SENSOR_TYPE_ORIENTATION:
		{
//			NRF_LOG_INFO("data event %s (e-3):, %d, %d, %d, Accuracy: %d ", inv_sensor_str(event->sensor),
//					(int)(event->data.orientation.x*1000),
//					(int)(event->data.orientation.y*1000),
//					(int)(event->data.orientation.z*1000),
//					(int)(event->data.orientation.accuracy_flag*1000)); // 0 - 3: not calibrated - fully calibrated
		NRF_LOG_INFO("%s:	%d %d %d", // rewritten write funtion to allow easier plotting
					inv_sensor_str(event->sensor),
					(int)(event->data.orientation.x),
					(int)(event->data.orientation.y),
					(int)(event->data.orientation.z));
//					(int)(event->data.orientation.accuracy_flag),
					// (int)(event->data.gyr.accuracy_flag),
					// (int)(event->data.acc.accuracy_flag),	
					// (int)(event->data.mag.accuracy_flag)); // 0 - 3: not calibrated - fully calibrated
					

			#ifdef USE_NUS		
				// 	float buffer_orientation[3];
				// 	buffer_orientation[0] = event->data.orientation.x;
				// 	buffer_orientation[1] = event->data.orientation.y;
				// 	buffer_orientation[2] = event->data.orientation.z;
					
				// // Put data in the ringbuffer
				// len_in = sizeof(buffer_orientation);					
				// err_code = nrf_ringbuf_cpy_put(&m_ringbuf, (uint8_t *)(buffer_orientation), &len_in); //(uint8_t *)(event->data.quaternion.quat)
				// APP_ERROR_CHECK(err_code);
			#endif

			fixed_point_t p_euler[3];

			float euler[3];
			euler[0] = event->data.orientation.x;
			euler[1] = event->data.orientation.y;
			euler[2] = event->data.orientation.z;

			p_euler[0] = float_to_fixed_euler(euler[0]);
			p_euler[1] = float_to_fixed_euler(euler[1]);
			p_euler[2] = float_to_fixed_euler(euler[2]);

            imu_data.euler.yaw   = p_euler[0];
            imu_data.euler.pitch  = p_euler[1];
            imu_data.euler.roll    = p_euler[2];
					
			break;
		}
		case INV_SENSOR_TYPE_BAC:
		{
//			INV_MSG(INV_MSG_LEVEL_INFO, "data event %s : %d %s", inv_sensor_str(event->sensor),
//					event->data.bac.event, activityName(event->data.bac.event));
				NRF_LOG_INFO("data event %s : %d %s", inv_sensor_str(event->sensor),
					event->data.bac.event, activityName(event->data.bac.event));
			break;
		case INV_SENSOR_TYPE_STEP_COUNTER:
			NRF_LOG_INFO("data event %s : %lu", inv_sensor_str(event->sensor),
					(unsigned long)event->data.step.count);
			break;
		case INV_SENSOR_TYPE_PICK_UP_GESTURE:
		case INV_SENSOR_TYPE_STEP_DETECTOR:
		case INV_SENSOR_TYPE_SMD:
				NRF_LOG_INFO("Wake on motion!");
			break;
		case INV_SENSOR_TYPE_B2S:
		case INV_SENSOR_TYPE_TILT_DETECTOR:
		default:
			NRF_LOG_INFO("DEFAULT");
			// INV_MSG(INV_MSG_LEVEL_INFO, "data event %s : ...", inv_sensor_str(event->sensor));
			break;
		}
	}
}
}

/*
 * A listener onject will handle sensor events
 */
inv_sensor_listener_t sensor_listener = {
        sensor_event_cb, /* callback that will receive sensor events */
        (void *)0xDEAD   /* some pointer passed to the callback */
};


/*
 * Printer function for IDD message facility
 */
void msg_printer(int level, const char * str, va_list ap)
{
	NRF_LOG_INFO(str);
	NRF_LOG_FLUSH();
}


/**
 * @}
 */


//void apply_stored_offsets(void)
//{
//	uint8_t sensor_bias[84];
//	int32_t acc_bias_q16[6] = {0}, gyro_bias_q16[6] = {0};
//	uint8_t i, idx = 0;
//	int rc;
//	
//	
//	// TODO own implementation needed
//	/* Retrieve Sel-test offsets stored in NV memory */
////	if(flash_manager_readData(sensor_bias) != 0) {
////		INV_MSG(INV_MSG_LEVEL_WARNING, "No bias values retrieved from NV memory !");
////		return;
////	}
//	
//	for(i = 0; i < 6; i++)
//		gyro_bias_q16[i] = inv_dc_little8_to_int32((const uint8_t *)(&sensor_bias[i * sizeof(uint32_t)]));
//	idx += sizeof(gyro_bias_q16);
//	rc = inv_device_set_sensor_config(device, INV_SENSOR_TYPE_GYROSCOPE,
//		VSENSOR_CONFIG_TYPE_OFFSET, gyro_bias_q16, sizeof(gyro_bias_q16));
//	check_rc(rc);
//	
//	for(i = 0; i < 6; i++)
//		acc_bias_q16[i] = inv_dc_little8_to_int32((const uint8_t *)(&sensor_bias[idx + i * sizeof(uint32_t)]));
//	idx += sizeof(acc_bias_q16);
//	rc = inv_device_set_sensor_config(device, INV_SENSOR_TYPE_ACCELEROMETER,
//		VSENSOR_CONFIG_TYPE_OFFSET, acc_bias_q16, sizeof(acc_bias_q16));

//}



//void store_offsets(void)
//{
//	int rc = 0;
//	uint8_t i, idx = 0;
//	int gyro_bias_q16[6] = {0}, acc_bias_q16[6] = {0};

//	uint8_t sensor_bias[84] = {0};
//	
//	/* Strore Self-test bias in NV memory */
//	rc = inv_device_get_sensor_config(device, INV_SENSOR_TYPE_GYROSCOPE,
//			VSENSOR_CONFIG_TYPE_OFFSET, gyro_bias_q16, sizeof(gyro_bias_q16));
//	check_rc(rc);
//	for(i = 0; i < 6; i++)
//		inv_dc_int32_to_little8(gyro_bias_q16[i], &sensor_bias[i * sizeof(uint32_t)]);
//	idx += sizeof(gyro_bias_q16);
//	
//	rc = inv_device_get_sensor_config(device, INV_SENSOR_TYPE_ACCELEROMETER,
//			VSENSOR_CONFIG_TYPE_OFFSET, acc_bias_q16, sizeof(acc_bias_q16));
//	check_rc(rc);
//	for(i = 0; i < 6; i++)
//		inv_dc_int32_to_little8(acc_bias_q16[i], &sensor_bias[idx + i * sizeof(uint32_t)]);
//	idx += sizeof(acc_bias_q16);

//	// TODO own implementation needed to store sensor_bias in non volatile memory
//	// flash_manager_writeData(sensor_bias);
//}




/* Interrupt pin handeler callback function */
void gpiote_evt_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
		ret_code_t err_code;
	
