jonacappelle/nRF52-BLE-IMU/IMU/imu.c
		if(pin == INT_PIN)
		{
				// NRF_LOG_INFO("IMU INTERRUPT");

				// If there are already events in the queue
				if(imu.evt_scheduled > 0)
				{
					imu.evt_scheduled++;
				}
				// If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
				else
				{
					imu.evt_scheduled++;
					err_code = app_sched_event_put(0, 0, imu_evt_poll_sceduled);
					APP_ERROR_CHECK(err_code);
				}
		}
}



// Event handler DIY
/**@brief GPIOTE sceduled handler, executed in main-context.
 */
void imu_evt_poll_sceduled(void * p_event_data, uint16_t event_size)
{
    while ( (imu.evt_scheduled > 0) )//&& m_mpu9250.enabled) TODO check when IMU is enabled or not
    {
		nrf_gpio_pin_set(PIN_IMU_ACTIVITY);
		
		// Poll all data from IMU
		inv_device_poll(device);

		nrf_gpio_pin_clear(PIN_IMU_ACTIVITY);
		imu.evt_scheduled--;
    }
}



ret_code_t imu_enable_sensors(IMU imu)
{
		int rc = 0;

		if(imu.stop)
		{
		// Stop all sensors before enabling the new ones
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_GAME_ROTATION_VECTOR);
		check_rc(rc);
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_ROTATION_VECTOR);
		check_rc(rc);
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_ORIENTATION);
		check_rc(rc);	
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_GYROSCOPE);
		check_rc(rc);	
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_ACCELEROMETER);
		check_rc(rc);	
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_MAGNETOMETER);
		check_rc(rc);
		}
		// If enabled: Start 6DoF quaternion output
		if(imu.quat6_enabled)
		{
		NRF_LOG_INFO("Start QUAT6");
		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_GAME_ROTATION_VECTOR);
		check_rc(rc);
		rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_GAME_ROTATION_VECTOR, IMU_DEFAULT_SAMPL_FREQ);
		check_rc(rc);
		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_GAME_ROTATION_VECTOR);
		check_rc(rc);
		}
		else if(!imu.quat6_enabled)
		{
		NRF_LOG_INFO("Stop QUAT6");
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_GAME_ROTATION_VECTOR);
		check_rc(rc);
		}
		// If enabled: Start 9DoF quaternion output
		if(imu.quat9_enabled)
		{
		NRF_LOG_INFO("Start QUAT9");
		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_ROTATION_VECTOR);
		check_rc(rc);
		rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_ROTATION_VECTOR, IMU_DEFAULT_SAMPL_FREQ);
		check_rc(rc);
		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_ROTATION_VECTOR);
		check_rc(rc);
		}
		if(!imu.quat9_enabled)
		{
		NRF_LOG_INFO("Stop QUAT9");
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_ROTATION_VECTOR);
		check_rc(rc);
		}
		// If enabled: Start Euler angles
		if(imu.euler_enabled)
		{
		NRF_LOG_INFO("Start 9DoF EULER");
		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_ORIENTATION);
		check_rc(rc);
		rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_ORIENTATION, IMU_DEFAULT_SAMPL_FREQ);
		check_rc(rc);
		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_ORIENTATION);
		check_rc(rc);
		}
		if(!imu.euler_enabled)
		{
		NRF_LOG_INFO("Stop 9DoF EULER");
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_ORIENTATION);
		check_rc(rc);
		}
		// If enabled: Start Calibrated Gyroscope output
		if(imu.gyro_enabled)
		{
		NRF_LOG_INFO("Start GYRO");
		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_GYROSCOPE);
		check_rc(rc);
		rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_GYROSCOPE, IMU_DEFAULT_SAMPL_FREQ);
		check_rc(rc);
		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_GYROSCOPE);
		check_rc(rc);
		}
		if(!imu.gyro_enabled)
		{
		NRF_LOG_INFO("Stop GYRO");
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_GYROSCOPE);
		check_rc(rc);
		}
		// If enabled: Start Calibrated Accelerometer output
		if(imu.accel_enabled)
		{
		NRF_LOG_INFO("Start ACCEL");
		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_ACCELEROMETER);
		check_rc(rc);
		rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_ACCELEROMETER, IMU_DEFAULT_SAMPL_FREQ);
		check_rc(rc);
		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_ACCELEROMETER);
		check_rc(rc);
		}
		if(!imu.accel_enabled)
		{
		NRF_LOG_INFO("Stop ACCEL");
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_ACCELEROMETER);
		check_rc(rc);
		}
		// If enabled: Start Calibrated Accelerometer output
		if(imu.mag_enabled)
		{
		NRF_LOG_INFO("Start MAG");
		rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_MAGNETOMETER);
		check_rc(rc);
		rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_MAGNETOMETER, IMU_DEFAULT_SAMPL_FREQ);
		check_rc(rc);
		rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_MAGNETOMETER);
		check_rc(rc);
		}
		if(!imu.mag_enabled)
		{
		NRF_LOG_INFO("Stop MAG");
		rc += inv_device_stop_sensor(device, INV_SENSOR_TYPE_MAGNETOMETER);
		check_rc(rc);
		}
		
		return NRF_SUCCESS;
}

static void imu_buff_init()
{
	ret_code_t err_code;

	// Initialize IMU FIFO structure
	err_code = app_fifo_init(&buff.imu_fifo, buff.imu_fifo_buff, (uint16_t)sizeof(buff.imu_fifo_buff));
	APP_ERROR_CHECK(err_code);

	// Initialize QUAT FIFO structure
	err_code = app_fifo_init(&buff.quat_fifo, buff.quat_fifo_buff, (uint16_t)sizeof(buff.quat_fifo_buff));
	APP_ERROR_CHECK(err_code);

	// Initialize RAW FIFO structure
	err_code = app_fifo_init(&buff.raw_fifo, buff.raw_fifo_buff, (uint16_t)sizeof(buff.raw_fifo_buff));
	APP_ERROR_CHECK(err_code);
}

void imu_clear_buff()
{
	ret_code_t err_code;

	// Clear all data in buffers
	err_code = app_fifo_flush(&buff.imu_fifo);
	APP_ERROR_CHECK(err_code);

	err_code = app_fifo_flush(&buff.quat_fifo);
	APP_ERROR_CHECK(err_code);

	err_code = app_fifo_flush(&buff.raw_fifo);
	APP_ERROR_CHECK(err_code);
}


void imu_init(void)
{
#if IMU_ENABLED == 1

		NRF_LOG_INFO("IMU Init");

		// Initialize necessary buffers for data transmission
		imu_buff_init();

		/*
		 * Setup message facility to see internal traces from IDD
		 */
		INV_MSG_SETUP(MSG_LEVEL, msg_printer);

		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		INV_MSG(INV_MSG_LEVEL_INFO, "#          20948 example          #");
		INV_MSG(INV_MSG_LEVEL_INFO, "###################################");
		NRF_LOG_FLUSH();

		/* To keep track of errors */
		int rc = 0;
		
		uint8_t whoami;
		
		/* Open serial interface (SPI or I2C) before playing with the device */
		// Not needed anymore - this is implemented in the inv_host_serif_open(&my_serif_instance)
//		twi_init();
		rc = inv_host_serif_open(&my_serif_instance);
		check_rc(rc);
		
		NRF_LOG_INFO("i2c init");
		NRF_LOG_FLUSH();
		
