jonacappelle/nRF52-BLE-IMU/IMU/imu.c
		/*
		 * Create ICM20948 Device 
		 * Pass to the driver:
		 * - reference to serial interface object,
		 * - reference to listener that will catch sensor events,
		 */
		inv_device_icm20948_init(&device_icm20948, &my_serif_instance, &sensor_listener, dmp3_image, sizeof(dmp3_image));
		
		/*
		 * Simply get generic device handle from Icm20948 Device
		 */
		device = inv_device_icm20948_get_base(&device_icm20948);
		NRF_LOG_FLUSH();
		
		/* Just get the whoami */
		rc += inv_device_whoami(device, &whoami);
		check_rc(rc);
		NRF_LOG_INFO("Data: 0x%x", whoami);
		NRF_LOG_FLUSH();
		
		/* Configure and initialize the Icm20948 device */
		NRF_LOG_INFO("Setting up ICM20948");
		NRF_LOG_FLUSH();
		rc += inv_device_setup(device);
		check_rc(rc);
		
		rc += inv_device_load(device, (int) NULL, dmp3_image, sizeof(dmp3_image), true /* verify */, (int) NULL);
		check_rc(rc);

		NRF_LOG_INFO("DMP Image loaded");
		NRF_LOG_FLUSH();
#endif
}






uint8_t number_of_quat_packets = 0;
uint8_t number_of_raw_packets = 0;




void imu_send_data()
{
	ret_code_t err_code;

	if(imu.quat6_enabled || imu.quat9_enabled)
	{
		ble_tms_single_quat_t single_quat;
		uint32_t single_quat_len = sizeof(single_quat);

		// Put data in send buffer + increment packet counter
		number_of_quat_packets++;

		// Get latest available data
		single_quat.w = imu_data.quat.w;
		single_quat.x = imu_data.quat.x;
		single_quat.y = imu_data.quat.y;
		single_quat.z = imu_data.quat.z;

		// Put data in send buffer
		err_code = app_fifo_write(&buff.quat_fifo, (uint8_t *) &single_quat, &single_quat_len);
		if (err_code == NRF_ERROR_NO_MEM)
		{
			NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
		}

		// If 10 packets are queued, send them out
		if( number_of_quat_packets >= BLE_PACKET_BUFFER_COUNT)
		{		
			ble_tms_quat_t data;
			uint32_t data_len = sizeof(data);

			err_code = app_fifo_read(&buff.quat_fifo, (uint8_t *) &data, &data_len);
			if (err_code == NRF_ERROR_NO_MEM)
			{
				NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
			}

			// Send data over BLE
			ble_send_quat(&data);

			number_of_quat_packets = 0;
			// NRF_LOG_INFO("quat set");
		}

	}
	if(imu.gyro_enabled || imu.accel_enabled || imu.mag_enabled)
	{
		ble_tms_single_raw_t single_raw;
		uint32_t single_raw_len = sizeof(single_raw);

		// Put data in send buffer + increment packet counter
		number_of_raw_packets++;

		// Get latest available data
		// Get last gyro data from buffer
		single_raw.gyro.x = imu_data.gyro.x;
		single_raw.gyro.y = imu_data.gyro.y;
		single_raw.gyro.z = imu_data.gyro.z;

		// Get last accel data from buffer
		single_raw.accel.x = imu_data.accel.x;
		single_raw.accel.y = imu_data.accel.y;
		single_raw.accel.z = imu_data.accel.z;

		// Get last mag data from buffer
		single_raw.compass.x = imu_data.mag.x;
		single_raw.compass.y = imu_data.mag.y;
		single_raw.compass.z = imu_data.mag.z;

		// Put data in send buffer
		err_code = app_fifo_write(&buff.raw_fifo, (uint8_t *) &single_raw, &single_raw_len);
		if (err_code == NRF_ERROR_NO_MEM)
		{
			NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
		}

		// If 10 packets are queued, send them out
		if( number_of_raw_packets >= BLE_PACKET_BUFFER_COUNT)
		{		
			ble_tms_raw_t data;
			uint32_t data_len = sizeof(data);

			err_code = app_fifo_read(&buff.raw_fifo, (uint8_t *) &data, &data_len);
			if (err_code == NRF_ERROR_NO_MEM)
			{
				NRF_LOG_INFO("QUAT FIFO BUFFER FULL!");
			}

			// Send data over BLE
			ble_send_raw(&data);

			number_of_raw_packets = 0;
			// NRF_LOG_INFO("quat set");
		}
	}
	if(imu.euler_enabled)
	{
		ble_tms_euler_t data;

		data.yaw = imu_data.euler.yaw;
		data.pitch = imu_data.euler.pitch;
		data.roll = imu_data.euler.roll;

		// Send data over BLE
		ble_send_euler(&data);

	}
	if(imu.adc)
	{
		ble_tms_adc_t data;

		data.raw[0] = 1;

		ble_send_adc(&data);

	}
}


// void imu_get_config()
// {
// 	int rc = 0;
		
// 	rc += inv_device_get_sensor_config(device, );
// 	check_rc(rc);
// }

void imu_set_config()
{
	int rc = 0;

	// 0 -> low power mode
	// 1 -> low noise mode
	inv_sensor_config_powermode_t power_mode;
	power_mode.lowpower_or_highperformance = 0;
    
	// rc = inv_device_set_sensor_config(device, 0, INV_SENSOR_CONFIG_POWER_MODE, &power_mode, 1);
	// check_rc(rc);

	NRF_LOG_INFO("Ping SMD");
	rc += inv_device_ping_sensor(device, INV_SENSOR_TYPE_SMD);
	check_rc(rc);

	NRF_LOG_INFO("Set SMD period");
	rc += inv_device_set_sensor_period(device, INV_SENSOR_TYPE_SMD, 0);
	check_rc(rc);

	NRF_LOG_INFO("Start SMD");
	rc += inv_device_start_sensor(device, INV_SENSOR_TYPE_SMD);
	check_rc(rc);

	// dmp_icm20948_set_wom_enable();
}


void imu_wom_enable(bool enable)
{
	int rc = 0;

	rc += inv_device_set_running_state(device, false);
	check_rc(rc);

	// rc += inv_device_set_sensor_config();
	// check_rc(rc);
}


void imu_deinit()
{
	int rc = 0;

	// Shutdown IMU and clear internal state
	rc += inv_device_cleanup(device);
	check_rc(rc);
}


// void apply_stored_offsets(void)
// {
// 	uint8_t sensor_bias[84];
// 	int32_t acc_bias_q16[6] = {0}, gyro_bias_q16[6] = {0};
// 	uint8_t i, idx = 0;
// 	int rc;
	
	
// 	// TODO own implementation needed
// 	/* Retrieve Sel-test offsets stored in NV memory */
// //	if(flash_manager_readData(sensor_bias) != 0) {
// //		INV_MSG(INV_MSG_LEVEL_WARNING, "No bias values retrieved from NV memory !");
// //		return;
// //	}
	
// 	for(i = 0; i < 6; i++)
// 		gyro_bias_q16[i] = inv_dc_little8_to_int32((const uint8_t *)(&sensor_bias[i * sizeof(uint32_t)]));
// 	idx += sizeof(gyro_bias_q16);
// 	rc = inv_device_set_sensor_config(device, INV_SENSOR_TYPE_GYROSCOPE,
// 		VSENSOR_CONFIG_TYPE_OFFSET, gyro_bias_q16, sizeof(gyro_bias_q16));
// 	check_rc(rc);
	
// 	for(i = 0; i < 6; i++)
// 		acc_bias_q16[i] = inv_dc_little8_to_int32((const uint8_t *)(&sensor_bias[idx + i * sizeof(uint32_t)]));
// 	idx += sizeof(acc_bias_q16);
// 	rc = inv_device_set_sensor_config(device, INV_SENSOR_TYPE_ACCELEROMETER,
// 		VSENSOR_CONFIG_TYPE_OFFSET, acc_bias_q16, sizeof(acc_bias_q16));

// }



// void store_offsets(void)
// {
// 	int rc = 0;
// 	uint8_t i, idx = 0;
// 	int gyro_bias_q16[6] = {0}, acc_bias_q16[6] = {0};

// 	uint8_t sensor_bias[84] = {0};
	
// 	/* Strore Self-test bias in NV memory */
// 	rc = inv_device_get_sensor_config(device, INV_SENSOR_TYPE_GYROSCOPE,
// 			VSENSOR_CONFIG_TYPE_OFFSET, gyro_bias_q16, sizeof(gyro_bias_q16));
// 	check_rc(rc);
// 	for(i = 0; i < 6; i++)
// 		inv_dc_int32_to_little8(gyro_bias_q16[i], &sensor_bias[i * sizeof(uint32_t)]);
// 	idx += sizeof(gyro_bias_q16);
	
// 	rc = inv_device_get_sensor_config(device, INV_SENSOR_TYPE_ACCELEROMETER,
// 			VSENSOR_CONFIG_TYPE_OFFSET, acc_bias_q16, sizeof(acc_bias_q16));
// 	check_rc(rc);
// 	for(i = 0; i < 6; i++)
// 		inv_dc_int32_to_little8(acc_bias_q16[i], &sensor_bias[idx + i * sizeof(uint32_t)]);
// 	idx += sizeof(acc_bias_q16);

// 	// TODO own implementation needed to store sensor_bias in non volatile memory
// 	// flash_manager_writeData(sensor_bias);
// }